In [1]:
import numpy as np
import pandas as pd

In [2]:
file = pd.read_excel("C:\\Users\\Satyam Singh\\Documents\\Marks.xlsx")

In [3]:
file

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,NaN,84,NaN,92,NaN,85,NaN,89,NaN,NaN
1,Akash,65,NaN,67,NaN,46,NaN,75,NaN,82,NaN,NaN
2,Rudra,54,NaN,71,NaN,87,NaN,45,NaN,78,NaN,NaN
3,Vivek,87,NaN,64,NaN,65,NaN,56,NaN,75,NaN,NaN
4,Aditya,45,NaN,56,NaN,75,NaN,65,NaN,65,NaN,NaN
5,Satyam,76,NaN,55,NaN,54,NaN,38,NaN,80,NaN,NaN

In [4]:
std_calculus = file['Calculus'].std()

In [5]:
std_calculus

18.052700628991772

In [6]:
mean_calculus = file['Calculus'].mean()

In [7]:
mean_calculus

np.float64(69.5)

In [8]:
std_eee = file['EEE'].std()

In [9]:
std_eee

10.722251007445529

In [10]:
mean_eee = file['EEE'].mean()

In [11]:
mean_eee

np.float64(66.16666666666667)

In [12]:
std_english = file['English'].std()

In [13]:
std_english

7.985403350280227

In [14]:
std_chemistry = file['Chemistry'].std()

In [15]:
std_chemistry

18.192489292745694

In [16]:
mean_chemistry = file['Chemistry'].mean()

In [17]:
mean_chemistry

np.float64(69.83333333333333)

In [18]:
std_cse = file['CSE'].std()

In [19]:
std_cse

17.8736304836669

In [20]:
mean_cse = file['CSE'].mean()

In [21]:
mean_cse

np.float64(60.666666666666664)

In [22]:
mean_english = file['English'].mean()

In [23]:
mean_english

np.float64(78.16666666666667)

In [24]:
# For Calculus

s = 1.5 * std_calculus + mean_calculus
a = 0.5 * std_calculus + mean_calculus
b = mean_calculus - 0.5 * std_calculus
c = mean_calculus - std_calculus
d = mean_calculus - 1.5 * std_calculus

def grade_calc(x):
    if x >= s:
        return 'S'
    elif x >= a:
        return 'A'
    elif x >= b:
        return 'B'
    elif x >= c:
        return 'C'
    elif x >= d:
        return 'D'
    else:
        return 'E'

file['Grade(Calculus)'] = file['Calculus'].apply(grade_calc)

In [25]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,NaN,92,NaN,85,NaN,89,NaN,NaN
1,Akash,65,B,67,NaN,46,NaN,75,NaN,82,NaN,NaN
2,Rudra,54,C,71,NaN,87,NaN,45,NaN,78,NaN,NaN
3,Vivek,87,A,64,NaN,65,NaN,56,NaN,75,NaN,NaN
4,Aditya,45,D,56,NaN,75,NaN,65,NaN,65,NaN,NaN
5,Satyam,76,B,55,NaN,54,NaN,38,NaN,80,NaN,NaN

In [26]:
# For EEE

s = 1.5 * std_eee + mean_eee
a = 0.5 * std_eee + mean_eee
b = mean_eee - 0.5 * std_eee
c = mean_eee - std_eee
d = mean_eee - 1.5 * std_eee

def grade_eee(x):
    if x >= s:
        return 'S'
    elif x >= a:
        return 'A'
    elif x >= b:
        return 'B'
    elif x >= c:
        return 'C'
    elif x >= d:
        return 'D'
    else:
        return 'E'

file['Grade(EEE)'] = file['EEE'].apply(grade_eee)

In [27]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,S,92,NaN,85,NaN,89,NaN,NaN
1,Akash,65,B,67,B,46,NaN,75,NaN,82,NaN,NaN
2,Rudra,54,C,71,B,87,NaN,45,NaN,78,NaN,NaN
3,Vivek,87,A,64,B,65,NaN,56,NaN,75,NaN,NaN
4,Aditya,45,D,56,C,75,NaN,65,NaN,65,NaN,NaN
5,Satyam,76,B,55,D,54,NaN,38,NaN,80,NaN,NaN

In [28]:
# For English
s = 1.5 * std_english + mean_english
a = 0.5 * std_english + mean_english
b = mean_english - 0.5 * std_english
c = mean_english - std_english
d = mean_english - 1.5 * std_english

def grade_english(x):
    if x >= s:
        return 'S'
    elif x >= a:
        return 'A'
    elif x >= b:
        return 'B'
    elif x >= c:
        return 'C'
    elif x >= d:
        return 'D'
    else:
        return 'E'

file['Grade(English)'] = file['English'].apply(grade_english)

In [29]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,S,92,NaN,85,NaN,89,A,NaN
1,Akash,65,B,67,B,46,NaN,75,NaN,82,B,NaN
2,Rudra,54,C,71,B,87,NaN,45,NaN,78,B,NaN
3,Vivek,87,A,64,B,65,NaN,56,NaN,75,B,NaN
4,Aditya,45,D,56,C,75,NaN,65,NaN,65,E,NaN
5,Satyam,76,B,55,D,54,NaN,38,NaN,80,B,NaN

In [30]:
# For CSE

s = 1.5 * std_cse + mean_cse
a = 0.5 * std_cse + mean_cse
b = mean_cse - 0.5 * std_cse
c = mean_cse - std_cse
d = mean_cse - 1.5 * std_cse

def grade_cse(x):
    if x >= s:
        return 'S'
    elif x >= a:
        return 'A'
    elif x >= b:
        return 'B'
    elif x >= c:
        return 'C'
    elif x >= d:
        return 'D'
    else:
        return 'E'

file['Grade(CSE)'] = file['CSE'].apply(grade_cse)

In [31]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,S,92,NaN,85,A,89,A,NaN
1,Akash,65,B,67,B,46,NaN,75,A,82,B,NaN
2,Rudra,54,C,71,B,87,NaN,45,C,78,B,NaN
3,Vivek,87,A,64,B,65,NaN,56,B,75,B,NaN
4,Aditya,45,D,56,C,75,NaN,65,B,65,E,NaN
5,Satyam,76,B,55,D,54,NaN,38,D,80,B,NaN

In [32]:
# For Chemistry

s = 1.5 * std_chemistry + mean_chemistry
a = 0.5 * std_chemistry + mean_chemistry
b = mean_chemistry - 0.5 * std_chemistry
c = mean_chemistry - std_chemistry
d = mean_chemistry - 1.5 * std_chemistry

def grade_chem(x):
    if x >= s:
        return 'S'
    elif x >= a:
        return 'A'
    elif x >= b:
        return 'B'
    elif x >= c:
        return 'C'
    elif x >= d:
        return 'D'
    else:
        return 'E'

file['Grade(Chemistry)'] = file['Chemistry'].apply(grade_chem)

In [33]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,S,92,A,85,A,89,A,NaN
1,Akash,65,B,67,B,46,D,75,A,82,B,NaN
2,Rudra,54,C,71,B,87,A,45,C,78,B,NaN
3,Vivek,87,A,64,B,65,B,56,B,75,B,NaN
4,Aditya,45,D,56,C,75,B,65,B,65,E,NaN
5,Satyam,76,B,55,D,54,C,38,D,80,B,NaN

In [39]:
# Grade to point mapping
grade_points = {
    'S': 10,
    'A': 9,
    'B': 8,
    'C': 7,
    'D': 6,
    'E': 5,
    'F': 0
}

# Credits
credits = {
    'Grade(Calculus)': 4,
    'Grade(EEE)': 4,
    'Grade(Chemistry)': 4,
    'Grade(CSE)': 4,
    'Grade(English)': 2
}

# Calculate CGPA without creating any extra column
file['CGPA'] = file.apply(
    lambda row: (
        sum(grade_points[row[col]] * credits[col] for col in credits)
        / sum(credits.values())
    ),
    axis=1
)

In [41]:
# Rounding off the cgpa to two decimal point

file['CGPA'] = file['CGPA'].round(2)

In [42]:
file.head(6)

,Name,Calculus,Grade(Calculus),EEE,Grade(EEE),Chemistry,Grade(Chemistry),CSE,Grade(CSE),English,Grade(English),CGPA
0,Satwik,90,A,84,S,92,A,85,A,89,A,9.22
1,Akash,65,B,67,B,46,D,75,A,82,B,7.78
2,Rudra,54,C,71,B,87,A,45,C,78,B,7.78
3,Vivek,87,A,64,B,65,B,56,B,75,B,8.22
4,Aditya,45,D,56,C,75,B,65,B,65,E,7.00
5,Satyam,76,B,55,D,54,C,38,D,80,B,6.89

In [46]:
file.to_excel("C:\\Users\\Satyam Singh\\Documents\\Marks.xlsx",index = False)

## Thank You!